let BaseLine = materialize(SecurityEvent  //30日前から前日までのサービス作成状況
| where EventID == 7045  //サービス作成イベント
| where TimeGenerated between (ago(30d) ..  ago(1d))
| summarize CreateCount = count() by Account = tolower(Account));

let Process = DeviceProcessEvents  //プロセス作成ログ
| where TimeGenerated > ago(1d)
| where tolower(FileName) in ("sc.exe", "powershell.exe", "cmd.exe") or tolower(ProcessCommandLine) has_any ("sc create", "new-service")  //サービス作成関連プロセスで抽出
| project ProcessTime = TimeGenerated, Account =tolower(AccountName), Computer = DeviceName, ProcessPath = FolderPath, ProcessCommandLine, ProcessIntegrityLevel, InitiatingProcessFileName, InitiatingProcessCommandLine 
| extend Session = bin(ProcessTime, 3m);

SecurityEvent
| where TimeGenerated > ago(1d)
| where EventID == 7045
| project TimeGenerated, Account = tolower(Account), Computer, ServiceName, ServiceFileName, ServiceType, ServiceStartType
| lookup BaseLine on Account
| extend Session = bin(TimeGenerated, 3m)
| join kind = leftouter Process on Account, Computer, Session
| where abs(datetime_diff('second',TimeGenerated , ProcessTime)) < 60 or isnull(ProcessTime)  //60秒以内のプロセス作成ログを抽出
| extend JPTimeGenerated = TimeGenerated + 9h
| extend EncodedLength = coalesce(strlen(extract(@"(?i)(-enc|-encodedcommand)\s+([A-Za-z0-9+/=]+)", 2, ProcessCommandLine)), 0)  //コマンドを暗号化している場合、文字数を抽出
| extend RiskScore = 0
                   + iff(ServiceStartType == "Auto", 10, 0)  //起動時のサービス自動実行設定がon
                   + iff(ServiceFileName has_any ("C:\\Users\\", "C:\\ProgramData\\", "AppData", "Temp"), 10, 0)  //サービスが不審なパスに存在 
                   + iff(ServiceFileName endswith ".ps1" or ServiceFileName endswith ".bat" or ServiceFileName endswith ".cmd", 10, 0)  //サービスの拡張子が不審
                   + iff(tolower(tostring(ServiceType)) has_any ("1", "2", "0x1", "0x2", "kernel", "file system") , 20, 0)  //サービスのタイプがカーネルレベル
                   + iff(ProcessCommandLine has_any ("IEX","ExecutionPolicy","Hidden", "WindowStyle","-nop", "-noni", "-nol", "-w hidden"), 10, 0)  //ファイルレスや画面非表示コマンド
                   + iff(ProcessCommandLine has_any ("FromBase64String", "-EncodedCommand", "-enc ","AmsiUtils", "amsi", "System.Management.Automation", "[Ref].Assembly", "Bypass", "Unblock-File"), 10, 0)  //コマンドの暗号化やdefender機能の無効化
                   + iff(EncodedLength >= 100, 10, 0)  //暗号化したコマンドの文字数が100文字以上
                   + iff(ProcessIntegrityLevel in ("high", "system"), 20, 0)  //コマンドの実行権限が高orシステム
                   + case(InitiatingProcessFileName in~ ("winword.exe", "excel.exe", "outlook.exe", "word.exe","mshta.exe", "regsvr32.exe"), 20,  //親プロセスが攻撃可能性高
                          InitiatingProcessFileName in~ ("explorer.exe","wscript.exe", "cscript.exe", "installutil.exe"), 10, 0)  //親プロセスが攻撃可能性中
                   + iff(datetime_part('hour', JPTimeGenerated) >= 22 or datetime_part('hour', JPTimeGenerated) <= 6 or toint(dayofweek(JPTimeGenerated)/1d) in (0, 6), 10, 0)  //深夜休日
                   + iff(isnull(ProcessTime), 10, 0)  //対応プロセスが見つからない（ステルスの可能性）
                   + iff(CreateCount == 0 or isnull(CreateCount), 20, 0)  //過去30日にサービス作成がなく、直近1日以内にサービスを作成したログを抽出
| extend RiskFlag = case(RiskScore >= 80, "High",
                         RiskScore >= 40, "Middle",
                         "Low")
| project JPTimeGenerated, Account, Computer, ServiceName, ServiceFileName, ServiceType, ServiceStartType, ProcessPath, ProcessCommandLine, ProcessIntegrityLevel, InitiatingProcessFileName, InitiatingProcessCommandLine, RiskScore, RiskFlag
